Scope для 2D гри «SERVARE»

1. Мета проекту
Створення базової 2D гри «Servare» з основною ігровою механікою, простим управлінням та стабільним функціонуванням на ПК.

2. Обсяг робіт (Scope)

Функціональність гри

1. Ігровий процес:
   - Реалізація базової механіки:
     - Рух персонажа (вліво, вправо).
     - Стрибок.
     - Лазіння по стінах.
   - Реакція персонажа на зіткнення з перешкодами .

2. Рівні:
   - Три рівні .
   - Наявність декількох перешкод (наприклад, шипи, шестерня, трамплін, трамплін стрілка, падаюча платформа, шипований мʼяч, вогонь).

3. Вороги:
   - Додавання одного типу ворога з простою поведінкою (рух по заданій траєкторії, при зіткненні персонажа відбувається Knockback, коли персонаж стрибає на голову ворогу, ворог помирає).

4. Управління:
   - Просте управління через клавіатуру: рух, стрибок, пауза.

5. Інтерфейс користувача (UI):
   - Мінімалістичне головне меню:
     - Почати гру.
     - Вихід.
   - Простий індикатор здоров’я та рахунок у грі.

6. Звук:
   - Простий звуковий супровід:
     - Один фоновий трек.

7. Тестування монет:

   - Збір монет:
     Коли персонаж наближається до монети, анімація збору повинна активуватися.
   - Оновлення рахунку:
     Рахунок повинен збільшуватися на 1 за кожну зібрану монету. Перевірити оновлення в реальному часі.

Тестування та продуктивність

1. Тестування продуктивності:
   - Операційна система: Windows 7/8/10 (64-bit) 
  - Процесор: Intel Core i3-3220 or equivalent AMD 
  - Пам’ять: 4 GB RAM 
  - Відеокарта: NVIDIA GTX 460 або рівноцінна AMD Radeon HD 5750 (DirectX 11 сумісні) 
  - Обсяг пам’яті: 2 GB 
  - Аудіоінтерфейс: DirectX 9.0c сумісні


2. Сумісність:
   - Перевірка гри на ПК з різними роздільними здатностями екрана 

3. Виключення (Out of Scope)
- Оптимізація для інших платформ.  
- Додаткові рівні, вороги чи складна механіка.

4. Результати (Deliverables)
1. Базова версія гри з трьома рівнями.  
2. Просте меню та мінімальний інтерфейс.  
3. Документація з інструкціями для гравців та базовим технічним описом.
